tutorials/pythonCavity/system/graphUniform
start   (0   0.099999999 0.005);
end     (0.1 0.099999999 0.005);
nPoints         100;
interpolationScheme cellPointFace;


fields          (Ux);

axis            x;

#includeEtc "caseDicts/postProcessing/graphs/graphUniform.cfg"

// ************************************************************************* //