tutorials/pythonCavity/system/singleGraph
singleGraph
{
    start   (0   0.099999999 0.005);
    end     (0.1 0.099999999 0.005);
    nPoints         100;
    interpolationScheme cellPointFace;
    fields          (Ux);

    #includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

    setConfig
    {
        axis    x;
    }

    // Must be last entry
    #includeEtc "caseDicts/postProcessing/graphs/graph.cfg"
}

// ************************************************************************* //
